---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DoorOperationType
source: html/b38730ae-6286-274f-e54d-6a11001632fe.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DoorOperationType Property

"Operation"

## Syntax (C#)
```csharp
public static ForgeTypeId DoorOperationType { get; }
```